mregueira/AudioDSP-v2.0/AudioDSP-v2.0/DOC/software/STM32/Core/Inc/DSP/DSP2/DSP2_IC_2_REG.h
/*
 * File:           C:\Users\Marcelo\Desktop\audioDSP\AudioDSP-v2.0\AudioDSP-v2.0\DOC\software\DSP2\IC 2_DSP2\DSP2_IC_2_REG.h
 *
 * Created:        Tuesday, May 23, 2023 8:55:08 PM
 * Description:    DSP2:IC 2 control register definitions.
 *
 * This software is distributed in the hope that it will be useful,
 * but is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
 * CONDITIONS OF ANY KIND, without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 *
 * This software may only be used to program products purchased from
 * Analog Devices for incorporation by you into audio products that
 * are intended for resale to audio product end users. This software
 * may not be distributed whole or in any part to third parties.
 *
 * Copyright ©2023 Analog Devices, Inc. All rights reserved.
 */
#ifndef __DSP2_IC_2_REG_H__
#define __DSP2_IC_2_REG_H__


/* InterfaceRegister0  - Registers (IC 2) */
#define REG_INTERFACEREGISTER0_IC_2_ADDR          0x800
#define REG_INTERFACEREGISTER0_IC_2_BYTE          4
#define REG_INTERFACEREGISTER0_IC_2_VALUE         0x0

/* InterfaceRegister1  - Registers (IC 2) */
#define REG_INTERFACEREGISTER1_IC_2_ADDR          0x801
#define REG_INTERFACEREGISTER1_IC_2_BYTE          4
#define REG_INTERFACEREGISTER1_IC_2_VALUE         0x0

/* InterfaceRegister2  - Registers (IC 2) */
#define REG_INTERFACEREGISTER2_IC_2_ADDR          0x802
#define REG_INTERFACEREGISTER2_IC_2_BYTE          4
#define REG_INTERFACEREGISTER2_IC_2_VALUE         0x0

/* InterfaceRegister3  - Registers (IC 2) */
#define REG_INTERFACEREGISTER3_IC_2_ADDR          0x803
#define REG_INTERFACEREGISTER3_IC_2_BYTE          4
#define REG_INTERFACEREGISTER3_IC_2_VALUE         0x0

/* InterfaceRegister4  - Registers (IC 2) */
#define REG_INTERFACEREGISTER4_IC_2_ADDR          0x804
#define REG_INTERFACEREGISTER4_IC_2_BYTE          4
#define REG_INTERFACEREGISTER4_IC_2_VALUE         0x0

/* InterfaceRegister5  - Registers (IC 2) */
#define REG_INTERFACEREGISTER5_IC_2_ADDR          0x805
#define REG_INTERFACEREGISTER5_IC_2_BYTE          4
#define REG_INTERFACEREGISTER5_IC_2_VALUE         0x0

/* InterfaceRegister6  - Registers (IC 2) */
#define REG_INTERFACEREGISTER6_IC_2_ADDR          0x806
#define REG_INTERFACEREGISTER6_IC_2_BYTE          4
#define REG_INTERFACEREGISTER6_IC_2_VALUE         0x0

/* InterfaceRegister7  - Registers (IC 2) */
#define REG_INTERFACEREGISTER7_IC_2_ADDR          0x807
#define REG_INTERFACEREGISTER7_IC_2_BYTE          4
#define REG_INTERFACEREGISTER7_IC_2_VALUE         0x0

/* GpioAllRegister  - Registers (IC 2) */
#define REG_GPIOALLREGISTER_IC_2_ADDR             0x808
#define REG_GPIOALLREGISTER_IC_2_BYTE             2
#define REG_GPIOALLREGISTER_IC_2_VALUE            0x0

/* Adc0  - Registers (IC 2) */
#define REG_ADC0_IC_2_ADDR                        0x809
#define REG_ADC0_IC_2_BYTE                        1
#define REG_ADC0_IC_2_VALUE                       0x0

/* Adc1  - Registers (IC 2) */
#define REG_ADC1_IC_2_ADDR                        0x80A
#define REG_ADC1_IC_2_BYTE                        1
#define REG_ADC1_IC_2_VALUE                       0x0

/* Adc2  - Registers (IC 2) */
#define REG_ADC2_IC_2_ADDR                        0x80B
#define REG_ADC2_IC_2_BYTE                        1
#define REG_ADC2_IC_2_VALUE                       0x0

/* Adc3  - Registers (IC 2) */
#define REG_ADC3_IC_2_ADDR                        0x80C
#define REG_ADC3_IC_2_BYTE                        1
#define REG_ADC3_IC_2_VALUE                       0x0

/* CoreRegister  - Registers (IC 2) */
#define REG_COREREGISTER_IC_2_ADDR                0x81C
#define REG_COREREGISTER_IC_2_BYTE                2
#define REG_COREREGISTER_IC_2_VALUE               0x1C

/* RAMRegister  - Registers (IC 2) */
#define REG_RAMREGISTER_IC_2_ADDR                 0x81D
#define REG_RAMREGISTER_IC_2_BYTE                 1
#define REG_RAMREGISTER_IC_2_VALUE                0xC

/* SerialOutRegister1  - Registers (IC 2) */
#define REG_SERIALOUTREGISTER1_IC_2_ADDR          0x81E
#define REG_SERIALOUTREGISTER1_IC_2_BYTE          2
#define REG_SERIALOUTREGISTER1_IC_2_VALUE         0x800

/* SerialInputRegister  - Registers (IC 2) */
#define REG_SERIALINPUTREGISTER_IC_2_ADDR         0x81F
#define REG_SERIALINPUTREGISTER_IC_2_BYTE         1
#define REG_SERIALINPUTREGISTER_IC_2_VALUE        0x0

/* MpCfg0  - Registers (IC 2) */
#define REG_MPCFG0_IC_2_ADDR                      0x820
#define REG_MPCFG0_IC_2_BYTE                      3
#define REG_MPCFG0_IC_2_VALUE                     0x442444

/* MpCfg1  - Registers (IC 2) */
#define REG_MPCFG1_IC_2_ADDR                      0x821
#define REG_MPCFG1_IC_2_BYTE                      3
#define REG_MPCFG1_IC_2_VALUE                     0x440444

/* AnalogPowerDownRegister  - Registers (IC 2) */
#define REG_ANALOGPOWERDOWNREGISTER_IC_2_ADDR     0x822
#define REG_ANALOGPOWERDOWNREGISTER_IC_2_BYTE     2
#define REG_ANALOGPOWERDOWNREGISTER_IC_2_VALUE    0x0

/* TestRegister  - Registers (IC 2) */
#define REG_TESTREGISTER_IC_2_ADDR                0x823
#define REG_TESTREGISTER_IC_2_BYTE                2
#define REG_TESTREGISTER_IC_2_VALUE               0x0

/* AnalogInterfaceRegister0  - Registers (IC 2) */
#define REG_ANALOGINTERFACEREGISTER0_IC_2_ADDR    0x824
#define REG_ANALOGINTERFACEREGISTER0_IC_2_BYTE    2
#define REG_ANALOGINTERFACEREGISTER0_IC_2_VALUE   0x8000

/* AnalogInterfaceRegister1  - Registers (IC 2) */
#define REG_ANALOGINTERFACEREGISTER1_IC_2_ADDR    0x825
#define REG_ANALOGINTERFACEREGISTER1_IC_2_BYTE    2
#define REG_ANALOGINTERFACEREGISTER1_IC_2_VALUE   0x0

/* AnalogInterfaceRegister2  - Registers (IC 2) */
#define REG_ANALOGINTERFACEREGISTER2_IC_2_ADDR    0x826
#define REG_ANALOGINTERFACEREGISTER2_IC_2_BYTE    2
#define REG_ANALOGINTERFACEREGISTER2_IC_2_VALUE   0x0

/* AnalogInterfaceRegister3  - Registers (IC 2) */
#define REG_ANALOGINTERFACEREGISTER3_IC_2_ADDR    0x827
#define REG_ANALOGINTERFACEREGISTER3_IC_2_BYTE    2
#define REG_ANALOGINTERFACEREGISTER3_IC_2_VALUE   0x1


