mregueira/AudioDSP-v2.0/AudioDSP-v2.0/DOC/software/STM32/Core/Inc/DSP/DSP2/DSP2_IC_2_REG.h
/*
 *
 * Control register's field descriptions
 *
 */

/* InterfaceRegister0 (IC 2) */
#define R0_INTERFACEREGISTER0_IC_2                0x00000000 /* 00000000000000000000000000000000b	[31:0] */
#define R0_INTERFACEREGISTER0_IC_2_MASK           0xFFFFFFFF
#define R0_INTERFACEREGISTER0_IC_2_SHIFT          0

/* InterfaceRegister1 (IC 2) */
#define R1_INTERFACEREGISTER1_IC_2                0x00000000 /* 00000000000000000000000000000000b	[31:0] */
#define R1_INTERFACEREGISTER1_IC_2_MASK           0xFFFFFFFF
#define R1_INTERFACEREGISTER1_IC_2_SHIFT          0

/* InterfaceRegister2 (IC 2) */
#define R2_INTERFACEREGISTER2_IC_2                0x00000000 /* 00000000000000000000000000000000b	[31:0] */
#define R2_INTERFACEREGISTER2_IC_2_MASK           0xFFFFFFFF
#define R2_INTERFACEREGISTER2_IC_2_SHIFT          0

/* InterfaceRegister3 (IC 2) */
#define R3_INTERFACEREGISTER3_IC_2                0x00000000 /* 00000000000000000000000000000000b	[31:0] */
#define R3_INTERFACEREGISTER3_IC_2_MASK           0xFFFFFFFF
#define R3_INTERFACEREGISTER3_IC_2_SHIFT          0

/* InterfaceRegister4 (IC 2) */
#define R4_INTERFACEREGISTER4_IC_2                0x00000000 /* 00000000000000000000000000000000b	[31:0] */
#define R4_INTERFACEREGISTER4_IC_2_MASK           0xFFFFFFFF
#define R4_INTERFACEREGISTER4_IC_2_SHIFT          0

/* InterfaceRegister5 (IC 2) */
#define R5_INTERFACEREGISTER5_IC_2                0x00000000 /* 00000000000000000000000000000000b	[31:0] */
#define R5_INTERFACEREGISTER5_IC_2_MASK           0xFFFFFFFF
#define R5_INTERFACEREGISTER5_IC_2_SHIFT          0

/* InterfaceRegister6 (IC 2) */
#define R6_INTERFACEREGISTER6_IC_2                0x00000000 /* 00000000000000000000000000000000b	[31:0] */
#define R6_INTERFACEREGISTER6_IC_2_MASK           0xFFFFFFFF
#define R6_INTERFACEREGISTER6_IC_2_SHIFT          0

/* InterfaceRegister7 (IC 2) */
#define R7_INTERFACEREGISTER7_IC_2                0x00000000 /* 00000000000000000000000000000000b	[31:0] */
#define R7_INTERFACEREGISTER7_IC_2_MASK           0xFFFFFFFF
#define R7_INTERFACEREGISTER7_IC_2_SHIFT          0

/* GpioAllRegister (IC 2) */
#define R8_PIN0_IC_2                              0x0    /* 0b	[0] */
#define R8_PIN1_IC_2                              0x0    /* 0b	[1] */
#define R8_PIN2_IC_2                              0x0    /* 0b	[2] */
#define R8_PIN3_IC_2                              0x0    /* 0b	[3] */
#define R8_PIN4_IC_2                              0x0    /* 0b	[4] */
#define R8_PIN5_IC_2                              0x0    /* 0b	[5] */
#define R8_PIN6_IC_2                              0x0    /* 0b	[6] */
#define R8_PIN7_IC_2                              0x0    /* 0b	[7] */
#define R8_PIN8_IC_2                              0x0    /* 0b	[8] */
#define R8_PIN9_IC_2                              0x0    /* 0b	[9] */
#define R8_PIN10_IC_2                             0x0    /* 0b	[10] */
#define R8_PIN11_IC_2                             0x0    /* 0b	[11] */
#define R8_PIN0_IC_2_MASK                         0x1
#define R8_PIN0_IC_2_SHIFT                        0
#define R8_PIN1_IC_2_MASK                         0x2
#define R8_PIN1_IC_2_SHIFT                        1
#define R8_PIN2_IC_2_MASK                         0x4
#define R8_PIN2_IC_2_SHIFT                        2
#define R8_PIN3_IC_2_MASK                         0x8
#define R8_PIN3_IC_2_SHIFT                        3
#define R8_PIN4_IC_2_MASK                         0x10
#define R8_PIN4_IC_2_SHIFT                        4
#define R8_PIN5_IC_2_MASK                         0x20
#define R8_PIN5_IC_2_SHIFT                        5
#define R8_PIN6_IC_2_MASK                         0x40
#define R8_PIN6_IC_2_SHIFT                        6
#define R8_PIN7_IC_2_MASK                         0x80
#define R8_PIN7_IC_2_SHIFT                        7
#define R8_PIN8_IC_2_MASK                         0x100
#define R8_PIN8_IC_2_SHIFT                        8
#define R8_PIN9_IC_2_MASK                         0x200
#define R8_PIN9_IC_2_SHIFT                        9
#define R8_PIN10_IC_2_MASK                        0x400
#define R8_PIN10_IC_2_SHIFT                       10
#define R8_PIN11_IC_2_MASK                        0x800
#define R8_PIN11_IC_2_SHIFT                       11

/* Adc0 (IC 2) */
#define R9_ADC0_IC_2                              0x00   /* 00000000b	[7:0] */
#define R9_ADC0_IC_2_MASK                         0xFF
#define R9_ADC0_IC_2_SHIFT                        0

/* Adc1 (IC 2) */
#define R10_ADC1_IC_2                             0x00   /* 00000000b	[7:0] */
#define R10_ADC1_IC_2_MASK                        0xFF
#define R10_ADC1_IC_2_SHIFT                       0

/* Adc2 (IC 2) */
#define R11_ADC2_IC_2                             0x00   /* 00000000b	[7:0] */
#define R11_ADC2_IC_2_MASK                        0xFF
#define R11_ADC2_IC_2_SHIFT                       0

/* Adc3 (IC 2) */
#define R12_ADC3_IC_2                             0x00   /* 00000000b	[7:0] */
#define R12_ADC3_IC_2_MASK                        0xFF
#define R12_ADC3_IC_2_SHIFT                       0

/* CoreRegister (IC 2) */
#define R13_PROGRAM_LENGTH_IC_2                   0x0    /* 00b	[1:0] */
#define R13_REGISTER_ZERO_IC_2                    0x1    /* 1b	[2] */
#define R13_MUTE_DAC_IC_2                         0x1    /* 1b	[3] */
#define R13_MUTE_ADC_IC_2                         0x1    /* 1b	[4] */
#define R13_SAFELOAD_IC_2                         0x0    /* 0b	[5] */
#define R13_WRITESPI_INTERFACEREG_IC_2            0x0    /* 0b	[6] */
#define R13_WRITESPI_GPIO_IC_2                    0x0    /* 0b	[7] */
#define R13_WRITESPI_ADC_IC_2                     0x0    /* 0b	[8] */
#define R13_MUTE_SERIALIN_IC_2                    0x0    /* 0b	[9] */
#define R13_GPIO_DEBOUNCE_IC_2                    0x0    /* 00b	[11:10] */
#define R13_EXTMEM_SPEED_IC_2                     0x0    /* 00b	[13:12] */
#define R13_PROGRAM_LENGTH_IC_2_MASK              0x3
#define R13_PROGRAM_LENGTH_IC_2_SHIFT             0
#define R13_REGISTER_ZERO_IC_2_MASK               0x4
#define R13_REGISTER_ZERO_IC_2_SHIFT              2
#define R13_MUTE_DAC_IC_2_MASK                    0x8
#define R13_MUTE_DAC_IC_2_SHIFT                   3
#define R13_MUTE_ADC_IC_2_MASK                    0x10
#define R13_MUTE_ADC_IC_2_SHIFT                   4
#define R13_SAFELOAD_IC_2_MASK                    0x20
#define R13_SAFELOAD_IC_2_SHIFT                   5
#define R13_WRITESPI_INTERFACEREG_IC_2_MASK       0x40
#define R13_WRITESPI_INTERFACEREG_IC_2_SHIFT      6
#define R13_WRITESPI_GPIO_IC_2_MASK               0x80
#define R13_WRITESPI_GPIO_IC_2_SHIFT              7
#define R13_WRITESPI_ADC_IC_2_MASK                0x100
#define R13_WRITESPI_ADC_IC_2_SHIFT               8
#define R13_MUTE_SERIALIN_IC_2_MASK               0x200
#define R13_MUTE_SERIALIN_IC_2_SHIFT              9
#define R13_GPIO_DEBOUNCE_IC_2_MASK               0xC00
#define R13_GPIO_DEBOUNCE_IC_2_SHIFT              10
#define R13_EXTMEM_SPEED_IC_2_MASK                0x3000
#define R13_EXTMEM_SPEED_IC_2_SHIFT               12

/* RAMRegister (IC 2) */
#define R14_RAM_MODULO_IC_2                       0xC    /* 1100b	[3:0] */
#define R14_RAM_MODULO_IC_2_MASK                  0xF
#define R14_RAM_MODULO_IC_2_SHIFT                 0

/* SerialOutRegister1 (IC 2) */
#define R15_WORDLENGTH_IC_2                       0x0    /* 00b	[1:0] */
#define R15_MSB_POS_IC_2                          0x0    /* 000b	[4:2] */
#define R15_TDM_IC_2                              0x0    /* 0b	[5] */
#define R15_FRAMESYNC_TYPE_IC_2                   0x0    /* 0b	[6] */
#define R15_LRCLK_FREQ_IC_2                       0x0    /* 00b	[8:7] */
#define R15_BCLK_FREQ_IC_2                        0x0    /* 00b	[10:9] */
#define R15_MASTER_SLAVE_IC_2                     0x1    /* 1b	[11] */
#define R15_BCLK_POLARITY_IC_2                    0x0    /* 0b	[12] */
#define R15_LRCLK_POLARITY_IC_2                   0x0    /* 0b	[13] */
#define R15_WORDLENGTH_IC_2_MASK                  0x3
#define R15_WORDLENGTH_IC_2_SHIFT                 0
#define R15_MSB_POS_IC_2_MASK                     0x1C
#define R15_MSB_POS_IC_2_SHIFT                    2
#define R15_TDM_IC_2_MASK                         0x20
#define R15_TDM_IC_2_SHIFT                        5
#define R15_FRAMESYNC_TYPE_IC_2_MASK              0x40
#define R15_FRAMESYNC_TYPE_IC_2_SHIFT             6
#define R15_LRCLK_FREQ_IC_2_MASK                  0x180
#define R15_LRCLK_FREQ_IC_2_SHIFT                 7
#define R15_BCLK_FREQ_IC_2_MASK                   0x600
#define R15_BCLK_FREQ_IC_2_SHIFT                  9
#define R15_MASTER_SLAVE_IC_2_MASK                0x800
#define R15_MASTER_SLAVE_IC_2_SHIFT               11
#define R15_BCLK_POLARITY_IC_2_MASK               0x1000
#define R15_BCLK_POLARITY_IC_2_SHIFT              12
#define R15_LRCLK_POLARITY_IC_2_MASK              0x2000
#define R15_LRCLK_POLARITY_IC_2_SHIFT             13

/* SerialInputRegister (IC 2) */
#define R16_INPUT_MODE_IC_2                       0x0    /* 000b	[2:0] */
#define R16_BCLK_POLARITY_IC_2                    0x0    /* 0b	[3] */
#define R16_LRCLK_POLARITY_IC_2                   0x0    /* 0b	[4] */
#define R16_INPUT_MODE_IC_2_MASK                  0x7
#define R16_INPUT_MODE_IC_2_SHIFT                 0
#define R16_BCLK_POLARITY_IC_2_MASK               0x8
#define R16_BCLK_POLARITY_IC_2_SHIFT              3
#define R16_LRCLK_POLARITY_IC_2_MASK              0x10
#define R16_LRCLK_POLARITY_IC_2_SHIFT             4

/* MpCfg0 (IC 2) */
#define R17_MFSELECT0_IC_2                        0x4    /* 100b	[2:0] */
#define R17_MFINVERT0_IC_2                        0x0    /* 0b	[3] */
#define R17_MFSELECT1_IC_2                        0x4    /* 100b	[6:4] */
#define R17_MFINVERT1_IC_2                        0x0    /* 0b	[7] */
#define R17_MFSELECT2_IC_2                        0x4    /* 100b	[10:8] */
#define R17_MFINVERT2_IC_2                        0x0    /* 0b	[11] */
#define R17_MFSELECT3_IC_2                        0x2    /* 010b	[14:12] */
#define R17_MFINVERT3_IC_2                        0x0    /* 0b	[15] */
#define R17_MFSELECT4_IC_2                        0x4    /* 100b	[18:16] */
#define R17_MFINVERT4_IC_2                        0x0    /* 0b	[19] */
#define R17_MFSELECT5_IC_2                        0x4    /* 100b	[22:20] */
#define R17_MFINVERT5_IC_2                        0x0    /* 0b	[23] */
#define R17_MFSELECT0_IC_2_MASK                   0x7
#define R17_MFSELECT0_IC_2_SHIFT                  0
#define R17_MFINVERT0_IC_2_MASK                   0x8
#define R17_MFINVERT0_IC_2_SHIFT                  3
#define R17_MFSELECT1_IC_2_MASK                   0x70
#define R17_MFSELECT1_IC_2_SHIFT                  4
#define R17_MFINVERT1_IC_2_MASK                   0x80
#define R17_MFINVERT1_IC_2_SHIFT                  7
#define R17_MFSELECT2_IC_2_MASK                   0x700
#define R17_MFSELECT2_IC_2_SHIFT                  8
#define R17_MFINVERT2_IC_2_MASK                   0x800
#define R17_MFINVERT2_IC_2_SHIFT                  11
#define R17_MFSELECT3_IC_2_MASK                   0x7000
#define R17_MFSELECT3_IC_2_SHIFT                  12
#define R17_MFINVERT3_IC_2_MASK                   0x8000
#define R17_MFINVERT3_IC_2_SHIFT                  15
#define R17_MFSELECT4_IC_2_MASK                   0x70000
#define R17_MFSELECT4_IC_2_SHIFT                  16
#define R17_MFINVERT4_IC_2_MASK                   0x80000
#define R17_MFINVERT4_IC_2_SHIFT                  19
#define R17_MFSELECT5_IC_2_MASK                   0x700000
#define R17_MFSELECT5_IC_2_SHIFT                  20
#define R17_MFINVERT5_IC_2_MASK                   0x800000
#define R17_MFINVERT5_IC_2_SHIFT                  23

/* MpCfg1 (IC 2) */
#define R18_MFSELECT6_IC_2                        0x4    /* 100b	[2:0] */
#define R18_MFINVERT6_IC_2                        0x0    /* 0b	[3] */
#define R18_MFSELECT7_IC_2                        0x4    /* 100b	[6:4] */
#define R18_MFINVERT7_IC_2                        0x0    /* 0b	[7] */
#define R18_MFSELECT8_IC_2                        0x4    /* 100b	[10:8] */
#define R18_MFINVERT8_IC_2                        0x0    /* 0b	[11] */
#define R18_MFSELECT9_IC_2                        0x0    /* 000b	[14:12] */
#define R18_MFINVERT9_IC_2                        0x0    /* 0b	[15] */
#define R18_MFSELECT10_IC_2                       0x4    /* 100b	[18:16] */
#define R18_MFINVERT10_IC_2                       0x0    /* 0b	[19] */
#define R18_MFSELECT11_IC_2                       0x4    /* 100b	[22:20] */
#define R18_MFINVERT11_IC_2                       0x0    /* 0b	[23] */
#define R18_MFSELECT6_IC_2_MASK                   0x7
#define R18_MFSELECT6_IC_2_SHIFT                  0
#define R18_MFINVERT6_IC_2_MASK                   0x8
#define R18_MFINVERT6_IC_2_SHIFT                  3
#define R18_MFSELECT7_IC_2_MASK                   0x70
#define R18_MFSELECT7_IC_2_SHIFT                  4
#define R18_MFINVERT7_IC_2_MASK                   0x80
#define R18_MFINVERT7_IC_2_SHIFT                  7
#define R18_MFSELECT8_IC_2_MASK                   0x700
#define R18_MFSELECT8_IC_2_SHIFT                  8
#define R18_MFINVERT8_IC_2_MASK                   0x800
#define R18_MFINVERT8_IC_2_SHIFT                  11
#define R18_MFSELECT9_IC_2_MASK                   0x7000
#define R18_MFSELECT9_IC_2_SHIFT                  12
#define R18_MFINVERT9_IC_2_MASK                   0x8000
#define R18_MFINVERT9_IC_2_SHIFT                  15
#define R18_MFSELECT10_IC_2_MASK                  0x70000
#define R18_MFSELECT10_IC_2_SHIFT                 16
#define R18_MFINVERT10_IC_2_MASK                  0x80000
#define R18_MFINVERT10_IC_2_SHIFT                 19
#define R18_MFSELECT11_IC_2_MASK                  0x700000
#define R18_MFSELECT11_IC_2_SHIFT                 20
#define R18_MFINVERT11_IC_2_MASK                  0x800000
#define R18_MFINVERT11_IC_2_SHIFT                 23

